10/data/attachments/fd5ab016e0c9fe59.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:friendsPageRequest>
            <nif:username>soap_friends_bd8adb16-4a75-4703-bb95-923bcd3b443a</nif:username>
            <nif:pageInfo>
                <nif:page>2</nif:page>
                <nif:size>3</nif:size>
                
            </nif:pageInfo>
            
        </nif:friendsPageRequest>
    </soapenv:Body>
</soapenv:Envelope>